src/Catalogs/ПараметрыДатчиковДТС/ПараметрыДатчиковДТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыДатчиковДТС</name>
  <attributes>
    <name>Параметр1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диапазон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ПараметрыДатчиковДТС/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(П1,П2,П3,П4,П5,П6,П7,П8)
ТЧ = Справочники.ПараметрыДатчиковДТС.СоздатьЭлемент();
ТЧ.Параметр1 = П1;
ТЧ.Параметр2 = П2;
ТЧ.Параметр3 = П3;
ТЧ.Параметр4 = П6;
ТЧ.Класс = П4;
ТЧ.Диапазон = П5;
ТЧ.ТУ = П7;
ТЧ.МП = П8;
ТЧ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c параметрами датчиков ДТС");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка параметров датчиков ДТС из файла..."); 
        ЗагрузитьИзФайлаНаСервере(СокрЛП(ExcelЛист.Cells(к,1).Value),СокрЛП(ExcelЛист.Cells(к,2).Value),СокрЛП(ExcelЛист.Cells(к,3).Value),СокрЛП(ExcelЛист.Cells(к,4).Value),СокрЛП(ExcelЛист.Cells(к,5).Value),СокрЛП(ExcelЛист.Cells(к,6).Value),СокрЛП(ExcelЛист.Cells(к,7).Value),СокрЛП(ExcelЛист.Cells(к,8).Value));
	    КонецЦикла;
	Результат.Excel.Quit();
	Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры
